Norlander/STM32F429I-DISCO_WS2812B_Cube/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

SPI_HandleTypeDef hspi3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI3_Init(void);
static void MX_ADC1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
/*uint8_t SPIBufGreen[9] = {
		0b11011011,  G
		0b01101101,  G
		0b10110110,  G
		0,  R
		0,  R
		0,  R
		0,  B
		0,  B
		0   B
};*/

uint8_t SPIBufGreen[9] = {
		0b11011011, /* G */
		0b01101101, /* G */
		0b10110110, /* G */
		0b10010010, /* R */
		0b01001001, /* R */
		0b00100100, /* R */
		0b10010010, /* B */
		0b01001001, /* B */
		0b00100100  /* B */
};

uint8_t SPIBufGreen50p[9] = {
		0b11010010, /* G */
		0b01001001, /* G */
		0b00100100, /* G */
		0b10010010, /* R */
		0b01001001, /* R */
		0b00100100, /* R */
		0b10010010, /* B */
		0b01001001, /* B */
		0b00100100  /* B */
};

uint8_t SPIBufRed[9] = {
		0b10010010, /* G */
		0b01001001, /* G */
		0b00100100, /* G */
		0b11011011, /* R */
		0b01101101, /* R */
		0b10110110, /* R */
		0b10010010, /* B */
		0b01001001, /* B */
		0b00100100  /* B */
};

uint8_t SPIBufBlue[9] = {
		0b10010010, /* G */
		0b01001001, /* G */
		0b00100100, /* G */
		0b10010010, /* R */
		0b01001001, /* R */
		0b00100100, /* R */
		0b11011011, /* B */
		0b01101101, /* B */
		0b10110110  /* B */
};

uint8_t SPIBufClear[9] = {
		0b10010010, /* G */
		0b01001001, /* G */
		0b00100100, /* G */
		0b10010010, /* R */
		0b01001001, /* R */
		0b00100100, /* R */
		0b10010010, /* B */
		0b01001001, /* B */
		0b00100100  /* B */
};

uint8_t SPIBufWhite[9] = {
		0b11011011, /* G */
		0b01101101, /* G */
		0b10110110, /* G */
		0b11011011, /* R */
		0b01101101, /* R */
		0b10110110, /* R */
		0b11011011, /* B */
		0b01101101, /* B */
		0b10110110  /* B */
};

uint8_t SPIBuf3White[27] = {
		0b11011011, /* G */
		0b01101101, /* G */
		0b10110110, /* G */
		0b11011011, /* R */
		0b01101101, /* R */
		0b10110110, /* R */
		0b11011011, /* B */
		0b01101101, /* B */
		0b10110110, /* B */
		0b11011011, /* G */
		0b01101101, /* G */
		0b10110110, /* G */
		0b11011011, /* R */
		0b01101101, /* R */
		0b10110110, /* R */
		0b11011011, /* B */
		0b01101101, /* B */
		0b10110110, /* B */
		0b11011011, /* G */
		0b01101101, /* G */
		0b10110110, /* G */
		0b11011011, /* R */
		0b01101101, /* R */
		0b10110110, /* R */
		0b11011011, /* B */
		0b01101101, /* B */
		0b10110110  /* B */
};


void fillSPIBuf(void);

#define s 1.002
#define t 1.001
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
volatile double result = s * t;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI3_Init();
  MX_ADC1_Init();

  /* USER CODE BEGIN 2 */

  /* SPI3 running at 2.5MHz. This gives means a bit will be shifted out on MOSI-line every 0,4us.
   * A WS2812B ONE is  0,8us HI + 0,4us LO
   * A WS2812B ZERO is  0,4us HI + 0,8us LO
   * In other words to send 255 to the 8-bit GREEN-LED use 8 * 3 = 24-bits:
   * 	0b11011011	-->
   * 	0b01101101	-->
   * 	0b10110110	-->
   * This means that to send ONE  2 HI + 1 LO bit must be sent. 0b110
   * This means that to send ZERO 1 HI + 2 LO bit must be sent. 0b100
   * A LED-Pixel contains RGB LEDs. Each LED has a resolution of "8-bits", [0 - 255].
   * To control one LED in the RGB-pixel 8 bits are need constituted of 3 ONE/ZERO bits --> 24bits
   * To control all colors (R-G-B) in the pixel 3 * 24bits = 72bits are needed.
   * uint8_t *SPIBuf[9] declared as global variable...
   */

