Norlander/STM32F429I-DISCO_WS2812B_Cube/Src/main.c
  volatile HAL_StatusTypeDef SPI_Status;

  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
  HAL_Delay(1000);

  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);


while (1)
{
  HAL_Delay(500);

  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);

  HAL_Delay(500);

  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);

  HAL_Delay(500);

  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);

  HAL_Delay(500);

  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufGreen50p, sizeof(SPIBufGreen50p), 10);
  SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
}
  //SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 1000);

  HAL_Delay(500);

  //SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 1000);

  HAL_Delay(500);

  //SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 1000);
  //HAL_Delay(1000);
  //SPI_Status = HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 1000);
  uint8_t color = 0;
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
//	  if()
//
//		  switch (color) {
//		case 1:
//
//			break;
//		case 2:
//
//			break;
//		case 3:
//
//					break;
//		case 4:
//
//					break;
//		case 5:
//
//					break;
//		default:
//			break;
	}
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 160;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* ADC1 init function */
static void MX_ADC1_Init(void)
{

  ADC_ChannelConfTypeDef sConfig;

    /**Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion) 
    */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = DISABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time. 
    */
  sConfig.Channel = ADC_CHANNEL_5;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

